Documents/ПриходОбрезков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>ПриходОбрезков</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ОбрезкиХлыстовойМатериал</xr:Item>
				<xr:Item>AccumulationRegister.ОбрезкиЛистовойМатериал</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СписокНоменклатуры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Высота</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ширина</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СписокХлыстовойНоменклатуры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Размер</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ПриходОбрезков/Ext/ManagerModule.bsl
Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	ЛексСервер.ПолучитьПредставлениеДокумента(Данные, Представление, СтандартнаяОбработка);

КонецПроцедуры

Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПриходОбрезков") Тогда
		ПодготовитьПечатнуюФорму("ПриходОбрезков", "Приход обрезков", "Документ.ПриходОбрезков.ПечатьПриходОбрезков",
		МассивОбъектов, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода);
	КонецЕсли;
	
	ПараметрыВывода.ДоступнаПечатьПоКомплектно = Истина;
	
КонецПроцедуры

Процедура ПодготовитьПечатнуюФорму(Знач ИмяМакета, ПредставлениеМакета, ПолныйПутьКМакету = "", МассивОбъектов, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода)
	
	НужноПечататьМакет = УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, ИмяМакета);
	
	Если НужноПечататьМакет Тогда
		
		Если ИмяМакета = "ПриходОбрезков" Тогда
			
			ТабДок = ПечатьПриходОбрезков(МассивОбъектов, ОбъектыПечати);
			
		КонецЕсли;
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, ИмяМакета,
		ПредставлениеМакета, ТабДок,, ПолныйПутьКМакету);
		
	КонецЕсли;
	
КонецПроцедуры

Функция ПечатьПриходОбрезков(МассивДокументов, ОбъектыПечати) Экспорт
	
	Макет = Документы.ПриходОбрезков.ПолучитьМакет("ПриходОбрезков");
	
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
	ОбластьШапкаХлыстовой = Макет.ПолучитьОбласть("ШапкаХлыстовой");
	ОбластьСтрокаХлыстовой = Макет.ПолучитьОбласть("СтрокаХлыстовой");
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал"); 
	
	ТабДок = Новый ТабличныйДокумент;
	ТабДок.ИмяПараметровПечати = "ПараметрыПечати_ПечатьПриходОбрезков";
	ТабДок.АвтоМасштаб = Истина;
	ТабДок.ОтображатьСетку = Ложь;
	ТабДок.Защита = Истина;
	ТабДок.ТолькоПросмотр = Истина;
	ТабДок.ОтображатьЗаголовки = Ложь;
	
	Запрос = Новый Запрос;
	Запрос.Параметры.Вставить("МассивДокументов", МассивДокументов);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Список.Ссылка КАК Док,
	|	Список.НомерСтроки КАК НомерСтроки,
	|	Список.Номенклатура,
	|	Список.Высота,
	|	Список.Ширина,
	|	0 КАК Размер,
	|	Список.Количество,
	|	0 КАК Вид
	|ПОМЕСТИТЬ втНоменклатура
	|ИЗ
	|	Документ.ПриходОбрезков.СписокНоменклатуры КАК Список
	|ГДЕ
	|	Список.Ссылка В(&МассивДокументов)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Список.Ссылка,
	|	Список.НомерСтроки,
	|	Список.Номенклатура,
	|	0,
	|	0,
	|	Список.Размер,
	|	Список.Количество,
	|	1
	|ИЗ
	|	Документ.ПриходОбрезков.СписокХлыстовойНоменклатуры КАК Список
	|ГДЕ
	|	Список.Ссылка В(&МассивДокументов)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Список.Док КАК Док,
	|	Список.НомерСтроки КАК НомерСтроки,
	|	Список.Номенклатура,
	|	Список.Высота,
	|	Список.Ширина,
	|	Список.Размер,
	|	Список.Количество,
	|	Список.Вид КАК Вид
	|ИЗ
	|	втНоменклатура КАК Список
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки,
	|	Вид
	|ИТОГИ ПО
	|	Док,
	|	Вид";
	
	ВыборкаДок = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ВставлятьРазделительСтраниц = Ложь;
	
	Пока ВыборкаДок.Следующий() Цикл
		
		НомерСтрокиНачало = ТабДок.ВысотаТаблицы + 1;
		
		Если ВставлятьРазделительСтраниц Тогда		
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();			
		КонецЕсли;
		
		Док = ВыборкаДок.Док;
		
		ОбластьЗаголовок.Параметры.Ссылка = Док;
		ОбластьЗаголовок.Параметры.Подразделение = Док.Подразделение; 
		ОбластьЗаголовок.Параметры.Комментарий = Док.Комментарий;
		
		ТабДок.Вывести(ОбластьЗаголовок);
		
		ВыборкаВид = ВыборкаДок.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаВид.Следующий() Цикл 
		
			Если ВыборкаВид.Вид = 0 Тогда
				 ОС = ОбластьСтрока; 
				 ТабДок.Вывести(ОбластьШапка);
			Иначе
				 ОС = ОбластьСтрокаХлыстовой;
				 ТабДок.Вывести(ОбластьШапкаХлыстовой);
			КонецЕсли;
			
			ВыборкаСтрока = ВыборкаВид.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
			Пока ВыборкаСтрока.Следующий() Цикл
				
				ОС.Параметры.Заполнить(ВыборкаСтрока);
				ТабДок.Вывести(ОС);
				
			КонецЦикла;
			
		КонецЦикла;
			
		ОбластьПодвал.Параметры.Автор = Док.Автор;
		ТабДок.Вывести(ОбластьПодвал);
				
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабДок, НомерСтрокиНачало, ОбъектыПечати, Док);
		
		ВставлятьРазделительСтраниц = Истина;

	КонецЦикла;
	
	Возврат ТабДок;
	
КонецФункции
